 /***************************************************************************
 * @简介:  检测雨滴并控制舵机动作
 * @接线:  舵机:棕色-GND、红色-5V、橙色-D9,雨滴模块:VCC-5V、GND-GND、DO-D2
 * @材料:  Arduino Nano开发板、SG90舵机、雨滴模块、杜邦线
 * @其他:  引入Servo库
 * @作者:  奈斯编程
 ***************************************************************************/

#include <Servo.h>                                          //引用舵机控制头文件

#define SERVO_PIN (9)                                       //舵机控制线连接数字D9引脚
#define RAIN_PIN (2)                                        //雨滴连接数字D9引脚

#define OPEN_WINDOW (150)                                   //开窗舵机旋转角度
#define CLOSE_WINDOW (20)                                   //关窗舵机旋转角度

Servo myservo;                                              //定义Servo对象
int rain_status = 0;                                        //定义雨滴状态变量,无雨为1,有雨为0
int windows_status = 0;                                     //定义窗户开关状态变量,开窗为0,关窗为1

 /***************************************************************************
 * @功能:  舵机PWM外设初始化和雨滴状态输入GPIO初始化
 * @输入:  无
 * @返回:  无
 ***************************************************************************/
void setup() {
    myservo.attach(SERVO_PIN);                              //舵机控制线连接数字D9引脚
    pinMode(RAIN_PIN, INPUT);                               //初始化D2引脚用来检测雨滴输入状态
}

 /***************************************************************************
 * @功能:  读取雨滴传感器状态并控制舵机
 * @输入:  无
 * @返回:  无
 ***************************************************************************/
void loop() {
    rain_status = digitalRead(2);                           //读取雨滴传感器状态,0为有雨,1为无雨
    if ((0 == rain_status)&&(0 == windows_status)) {        //有雨且当前窗户为开才执行关窗动作,避免舵机重复动作
        myservo.write(CLOSE_WINDOW);                        //舵机角度写入,关窗
        windows_status = 1;                                 //设置为关转态
        delay(500);                                         //等待舵机机械响应时间
    }
    else if ((1 == rain_status)&&(1 == windows_status)) {   //无雨且当前窗户为关才执行开窗动作,避免舵机重复动作
        myservo.write(OPEN_WINDOW);                         //舵机角度写入,开窗
        windows_status = 0;                                 //设置为开转态
        delay(500);                                         //等待舵机机械响应时间
    }
    else {                                                  //其他情况保持不变,避免舵机重复动作

    }
}
