 /***************************************************************************
 * @简介:  
 * @接线:  
 * @材料:  
 * @其他:  
 * @作者:  奈斯编程
 ***************************************************************************/
#define FAN_PIN (3)								//定义D3作为风扇PWM控制引脚
#define POT_PIN (21)							//定义D21作为电位器引脚

int value = 0;
 /***************************************************************************
 * @功能:  初始化风扇控制和电位器GPIO
 * @输入:  无
 * @返回:  无
 ***************************************************************************/
void setup() {
	pinMode(FAN_PIN,OUTPUT);
	pinMode(POT_PIN,INPUT);
}

 /***************************************************************************
 * @功能:  无
 * @输入:  无
 * @返回:  无
 ***************************************************************************/
void loop() {

    value = analogRead(POT_PIN);   

	if (value < 50) {
		analogWrite(FAN_PIN,0);//模拟输出
	}
	else if (value > 255) {
		analogWrite(FAN_PIN,255);//模拟输出
	}
	else {
		analogWrite(FAN_PIN,value);//模拟输出
	}
}

