 /***************************************************************************
 * @简介:  检测雨滴并控制舵机动作
 * @接线:  舵机:棕色-GND、红色-5V、橙色-D9,雨滴模块:VCC-5V、GND-GND、DO-D2
 * @材料:  Arduino Nano开发板、SG90舵机、雨滴模块、杜邦线
 * @其他:  引入Servo库
 * @作者:  奈斯编程
 ***************************************************************************/

#include <Servo.h>                                          //引用舵机控制头文件
#include <SPI.h>
#include <MFRC522.h>


#define SERVO_PIN (9)                                       //舵机控制线连接数字D9引脚
#define RAIN_PIN (2)                                        //雨滴连接数字D9引脚

#define OPEN_WINDOW (150)                                   //开窗舵机旋转角度
#define CLOSE_WINDOW (20)                                   //关窗舵机旋转角度

Servo myservo;                                              //定义Servo对象

 /***************************************************************************
 * @功能:  无
 * @输入:  无
 * @返回:  无
 ***************************************************************************/
void setup() {
    myservo.attach(SERVO_PIN);                              //舵机控制线连接数字D9引脚
}

 /***************************************************************************
 * @功能:  无
 * @输入:  无
 * @返回:  无
 ***************************************************************************/
void loop() {

}

